getwd()
setwd("D:/limworkspace/R_lecture/Part3/data")
setwd("D:/limworkspace/R_lecture/Part3")
getwd()

#--------------------------------------------------------------#
#------------------ section 8 : 다양한 함수 --------------------#
#--------------------------------------------------------------#

# 8.2 많이 사용되는 수학관련 함수 ----------------------------------------------------------------------------------------

log(10)                          # 지수로그
log10(10)                        # 상용로그

abs(seq(-3,-1))                  # 절대값 

a <- c(2.1, 3.51, 3.49, -2.3, -5.9)
ceiling(a)                       # 올림
floor(a)                         # 내림
round(a)                         # 반올림
choose()                         # nCr : 조합 ( n! / r! (n-r)!)

# 8.3 사용자 정의 함수 - function() {} ------------------------------------------------------------------------------------

myfunc <- function() {
  return(10)
}

myfunc()

myfunc2 <- function(x) {
  y <- x*x
  return(y)
}

myfunc2(-3)

# 함수 연습문제 -----------------------------------------------------------------------------------------------------------

exfunc1 <- function(a,b) {
  y = a-b
  return(y)
}

exfunc1(3,2)
exfunc1(2,3)

exfunc2 <- function(a,b) {
  y = abs(exfunc1(a,b))
  return(y)
}

exfunc2(3,2)
exfunc2(2,3)

# 숫자야구 게임 만들기 ----------------------------------------------------------------------------------------------------

BBgame<-function(chance){
  cat(" 야구게임을 시작합니다.","\n",
      "서로 다른 네 자리 숫자를 입력해 주세요. 
  (단, 중복숫자는 불가능)","\n","\n")
  x<-sample(0:9,4)
  for(i in 1:chance){
    cat("\n < ",i,"회  >")
    n=scan(nmax = 1,quiet = T)
    n1<-floor(gn/1000) 
    n2<-floor((gn%%1000)/100)
    n3<-floor((gn%%100)/10)
    n4<-gn%%10
    full_n <- (x[1]*1000)+(x[2]*100)+(x[3]*10)+(x[4])
    
    s<-0; b<-0
    if(x[1]==n1){s=s+1}
    if(x[2]==n2){s=s+1} 
    if(x[3]==n3){s=s+1}
    if(x[4]==n4){s=s+1}
    
    if(x[1]==n2){b=b+1}
    if(x[1]==n3){b=b+1}
    if(x[1]==n4){b=b+1}
    
    if(x[2]==n1){b=b+1}
    if(x[2]==n3){b=b+1}
    if(x[2]==n4){b=b+1}
    
    if(x[3]==n1){b=b+1}
    if(x[3]==n2){b=b+1}
    if(x[3]==n4){b=b+1}
    
    if(x[4]==n1){b=b+1}
    if(x[4]==n2){b=b+1}
    if(x[4]==n3){b=b+1}
    
    cat(s,"스트라이크!!",b,"볼!!","\n","\n")
    if(full_n==n){cat("홈~런!! 수고하셨습니다.");break}
  }
  if(full_n!=n){cat("실패하셨습니다. 재도전 하시겠습니까 ? \n")}
}
BBgame(10)

# 8.4 데이터 정렬하기 - sort ----------------------------------------------------------------------------------------------

sort1 <- Fruits$Sales; sort1
sort(sor1)                      # 디폴트 : 오름차순 
sort(sor1, decreasing = T)      # decreasing = T 옵션 : 내림차순 정렬 
